WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/commands/hcom_nx_ex_flash.c
  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0,
          "Bulk erase started (~2 minutes)", thisFile, __LINE__);

  syslog(LOG_INFO, "Bulk erase of External Flash begun\n");

  ret = _mtd->ioctl(_mtd, MTDIOC_BULKERASE, 0);
  if (ret < 0)
  {
    cmdData->logLevel = LOG_ERR;
    // Don't use snprintf_chk here
    cmdData->logLen = snprintf(cmdData->logMsg, HCOM_NX_CMD_LOG_MSG_SIZE,
            "%s@%d-IOCTL MTDIOC_BULKERASE Err:%d\n", thisFile, __LINE__, ret);

    char hostMsg[HCOM_NX_CMD_HOST_MSG_SIZE];
    snprintf_chk(hostMsg, HCOM_NX_CMD_HOST_MSG_SIZE,
              "Bulk Erase of QSPI Flash error:%d", ret);
    cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0, hostMsg,
            thisFile, __LINE__);
    return ret;
  }

  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0,
          "Bulk erase complete", thisFile, __LINE__);

  syslog(LOG_INFO, "Bulk erase complete\n\n");
  return OK;
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_verify_ex_flash
 *
 * Description:
 *  Verify that the external flash has been erased.
 *
 * Input Parameters:
 *  cmdData - Pointer to the command data structure holding the parameters
 *            (arguments) from CLI.
 *
 * Returned Value:
 *  OK on success, negative error code on error.
 *
 * Assumptions/Limitations:
 *  _mtd is set for the current flash driver.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_verify_ex_flash(struct hcom_nx_cmd_data *cmdData)
{
  FAR struct mtd_geometry_s geo;
  int sectorCounter;
  int notErasedSectors;
  int ret;

  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0,
          "External flash verification started", thisFile, __LINE__);

  syslog(LOG_NOTICE, "Verification of External Flash Erased beginning\n");

  // Get geometry of QSPI Flash
  ret = _mtd->ioctl(_mtd, MTDIOC_GEOMETRY, (unsigned long)((uintptr_t)&geo));
  if (ret < 0)
  {
    cmdData->logLevel = LOG_ERR;
    // Don't use snprintf_chk here
    cmdData->logLen = snprintf(cmdData->logMsg, HCOM_NX_CMD_LOG_MSG_SIZE,
            "%s@%d-Read geo for MTD:%d\n", thisFile, __LINE__, ret);
    return ret;
  }

  syslog(LOG_INFO, "Verifying MTD erase, sectors %d, era size %d pagesize %d\n",
           geo.neraseblocks, geo.erasesize, geo.blocksize);

  uint32_t writeable_pages_per_sector = geo.erasesize / geo.blocksize;
  uint8_t *readBuffer = (uint8_t *)malloc(geo.blocksize * writeable_pages_per_sector);
  if(readBuffer == NULL)
  {
    syslog(LOG_ERR, "%s@%d-malloc returned NULL\n", thisFile, __LINE__);
    return -ENOMEM;
  }
  
  uint8_t *baseReference = (uint8_t *)malloc(geo.blocksize * writeable_pages_per_sector);
  if(baseReference == NULL)
  {
    free(readBuffer);
    syslog(LOG_ERR, "%s@%d-malloc returned NULL\n", thisFile, __LINE__);
    return -ENOMEM;
  }
  
  memset(baseReference, 0xff, geo.blocksize * writeable_pages_per_sector); // base line for erased flash

  notErasedSectors = 0;
  for (sectorCounter = 0; sectorCounter < geo.neraseblocks; sectorCounter++)
  {
    size_t pagesRead = MTD_BREAD(_mtd, sectorCounter * writeable_pages_per_sector,
                                  writeable_pages_per_sector, readBuffer);
    if (pagesRead == writeable_pages_per_sector)
    {
      ret = memcmp(baseReference, readBuffer, geo.blocksize * writeable_pages_per_sector);
      if (ret != 0)
      {
        syslog(LOG_WARNING, "%s@%d-4k sector at offset %04d is not erased\n",
            thisFile, __LINE__, sectorCounter);
        notErasedSectors++;
      }
      continue;
    }

    if (pagesRead == 0)
      break; // End of data

    cmdData->logLevel = LOG_ERR;
    // Don't use snprintf_chk here
    cmdData->logLen = snprintf(cmdData->logMsg, HCOM_NX_CMD_LOG_MSG_SIZE,
            "%s@%d-Expected %d pages but read %d\n",
            thisFile, __LINE__, writeable_pages_per_sector, pagesRead);
    break;
  }

  syslog(LOG_INFO, "Verified %04d bytes (%d of %d sectors)\n",
           sectorCounter * geo.erasesize, sectorCounter, geo.neraseblocks);
  syslog(LOG_NOTICE, "Verify complete, %d non-erased 4KB sectors\n\n", notErasedSectors);

  // Send text message to host
  char hostMsg[HCOM_NX_CMD_HOST_MSG_SIZE];
  snprintf_chk(hostMsg, HCOM_NX_CMD_HOST_MSG_SIZE,
            "Verified %04d bytes (%d of %d sectors), found %d not erased.",
            sectorCounter * geo.erasesize, sectorCounter, geo.neraseblocks, notErasedSectors);
  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0, hostMsg,
          thisFile, __LINE__);

  free(baseReference);
  free(readBuffer);
  return OK;
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_renew_file_system
 *
 * Description:
 *  Process the CLI request to renew the file system.
 * 
 *  This method erases the first 16 blocks of the file system.  This makes
 *  the file system appear as if it is new and no files are present.
 *
 * Input Parameters:
 *  cmdData - userData in cmdData contains the partition id.
 *
 * Returned Value:
 *  OK on success, negative error code on error.
 *
 * Assumptions/Limitations:
 *  _mtd is set for the current flash driver.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_renew_file_system(struct hcom_nx_cmd_data *cmdData)
{
  int ret;

  // userData has partition id
  int sectorOffset = hcom_nx_fs_1st_erase_sector_of_partition(cmdData->userData);

  // Erase the first few sectors of the partition and restart the MCU
  ret = MTD_ERASE(_mtd, sectorOffset, 16);
  if (ret < 0)
  {
    cmdData->logLevel = LOG_ERR;
    // Don't use snprintf_chk here
    cmdData->logLen = snprintf(cmdData->logMsg, HCOM_NX_CMD_LOG_MSG_SIZE,
            "%s@%d-flash erase SectorOffset %d, err:%d\n", thisFile, __LINE__, sectorOffset, ret);
    return ret;
  }
   return OK;
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_get_block_size
 *
 * Description:
 *  Get the block size for the flash memory.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  Block size in bytes.
 *
 * Assumptions/Limitations:
 *  _mtd is set for the current flash driver.
 *
 ****************************************************************************/
uint32_t hcom_nx_exec_ex_flash_get_block_size(void)
{
  struct mtd_geometry_s geo;

