WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/commands/hcom_nx_ex_flash.c
    if (memcmp(buf, verify, geo.blocksize) != 0)
    {
      syslog(LOG_ERR, "Error while verifying block %d.\n", i);
      goto cleanup;
    }
#endif
  }
  info("Flash operation complete");
cleanup:
  close(filefd);
  // if(cmdData->logLevel != LOG_NONE)
  //   return -1;
  return OK;
}

// mirroring the individual flags in bootloader/Core/Inc/ota_data.h
typedef struct
{
  uint8_t update;
  uint8_t rollback;
  uint8_t backup_flag;
  uint8_t update_failure_flag;
  uint8_t rollback_failure;
  uint8_t backup_failure;
  uint8_t rollback_on_fail;
  uint8_t reserved[0x1000 - 7]; // min struct size = flash geo.erasesize
} OTAState;

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_OS_update_flash1
 *
 * Description:
 *   Part 1 update - AUpdate the operating system.
 * 
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *  OK if successful, -1 or -errno if there was a problem.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_OS_update_flash1(void)
{
  int ret;
  OTAState state = {0};
  ret = flash_file(UPDATE_OS_DIR HCOM_NX_FS_NUTTX_UPDATE_FILENAME, HCOM_NX_FS_NUTTX_UPDATE_SIZE, HCOM_NX_FS_MONO_RAW_PARTITION_SIZE);
  if (ret)
    return ret;
  //
  //  Save the current OTA state to flash
  //
  state.update = 0x1;
  ret = hcom_nx_exec_ex_flash_write_buffer_to_flash((uint8_t*)&state, sizeof(OTAState), HCOM_NX_FS_MONO_RAW_PARTITION_SIZE + HCOM_NX_FS_NUTTX_UPDATE_SIZE);
  if (ret)
    return ret;
  ret = unlink(UPDATE_OS_DIR HCOM_NX_FS_NUTTX_UPDATE_FILENAME);
  if (ret)
    return ret;
  hcom_nx_common_utils_host_restart_meadow();
  return 0; // restarts; never actually returns
}

/****************************************************************************
 * Name: hcom_nx_exec_ex_flash_OS_update_flash2
 *
 * Description:
 *   Part 2 update - Update the runtime system.
 *   flash.
 * 
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *  OK if successful, -1 or -errno if there was a problem.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
int hcom_nx_exec_ex_flash_OS_update_flash2(void)
{
  int ret;
  ret = flash_file(UPDATE_OS_DIR HCOM_NX_FS_MONO_RUNTIME_FILENAME, HCOM_NX_FS_MONO_RAW_PARTITION_SIZE, 0x0);
  if (ret)
    return ret;
  ret = unlink(UPDATE_OS_DIR HCOM_NX_FS_MONO_RUNTIME_FILENAME);
  if (ret)
    return ret;
  hcom_nx_common_utils_host_restart_meadow();
  return 0; // restarts; never actually returns
}
